app/controllers/movies_controller.rb

SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    @all_ratings = Movie.uniq.pluck(:rating)

    @sort = (params[:sort]) ? params[:sort] : session[:sort]

    if params[:ratings].nil?
        @selected_ratings = session[:ratings].nil? ? Hash[@all_ratings.map { |x| [x,x] } ] : session[:ratings] ; flash.keep ; redirect_to movies_path(:sort => @sort, :ratings => @selected_ratings)